Merging and Concat DataFrame In Pandas

Merge

In [1]:
import pandas as pd
import numpy as np

In [13]:
var1 = pd.DataFrame({"A":[1,2,3,4], "B":[11,12,13,14]})
var2 = pd.DataFrame({"A":[1,2,3,5], "C":[21,22,23,24]})

In [14]:
print(var1)
print(var2)

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
   A   C
0  1  21
1  2  22
2  3  23
3  5  24

In [15]:
pd.merge(var1,var2, on="A")

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23

In [16]:
pd.merge(var1,var2, how="inner")

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23

In [17]:
pd.merge(var1,var2, how="left")

   A   B     C
0  1  11  21.0
1  2  12  22.0
2  3  13  23.0
3  4  14   NaN

In [18]:
pd.merge(var1,var2, how="right")

   A     B   C
0  1  11.0  21
1  2  12.0  22
2  3  13.0  23
3  5   NaN  24

In [19]:
pd.merge(var1,var2, how="outer")

   A     B     C
0  1  11.0  21.0
1  2  12.0  22.0
2  3  13.0  23.0
3  4  14.0   NaN
4  5   NaN  24.0

In [22]:
pd.merge(var1,var2, how="outer", indicator=True)

   A     B     C      _merge
0  1  11.0  21.0        both
1  2  12.0  22.0        both
2  3  13.0  23.0        both
3  4  14.0   NaN   left_only
4  5   NaN  24.0  right_only

In [25]:
var3 = pd.DataFrame({"a":[1,2,3], "b":[2,4,6]})
var4 = pd.DataFrame({"a":[1,2,3], "b":[8,10,12]})

In [27]:
pd.merge(var3, var4, left_index=True, right_index=True)

   a_x  b_x  a_y  b_y
0    1    2    1    8
1    2    4    2   10
2    3    6    3   12

In [28]:
pd.merge(var3, var4, left_index=True, right_index=True, suffixes=("python", "java"))

   apython  bpython  ajava  bjava
0        1        2      1      8
1        2        4      2     10
2        3        6      3     12

Concat

In [30]:
# Concat use for join two serise
sr1 = pd.Series([1,2,3,4])
sr2 = pd.Series([11,21,31,41])

In [31]:
print(sr1)
print(sr2)

0    1
1    2
2    3
3    4
dtype: int64
0    11
1    21
2    31
3    41
dtype: int64

In [33]:
# Concat two Series
pd.concat([sr1, sr2])

0     1
1     2
2     3
3     4
0    11
1    21
2    31
3    41
dtype: int64

In [34]:
df1 = pd.DataFrame({"i":[1,2,3,4],"j":[4,3,2,1]})
df2 = pd.DataFrame({"i":[1,2,3,4],"j":[14,13,12,11]})

In [35]:
# Concat two DataFrames
pd.concat([df1, df2])

   i   j
0  1   4
1  2   3
2  3   2
3  4   1
0  1  14
1  2  13
2  3  12
3  4  11

In [37]:
pd.concat([df1,df2], axis=1)  # axis = 0, 1

   i  j  i   j
0  1  4  1  14
1  2  3  2  13
2  3  2  3  12
3  4  1  4  11

In [43]:
d1 = pd.DataFrame({"j":[1,2,3,4],"k":[10,20,30,40]})
d2 = pd.DataFrame({"j":[1,2],"k":[10,20]})

In [46]:
pd.concat([d1,d2], axis=1, join="outer")

   j   k    j     k
0  1  10  1.0  10.0
1  2  20  2.0  20.0
2  3  30  NaN   NaN
3  4  40  NaN   NaN

In [47]:
pd.concat([d1,d2], axis=1, join="inner")

   j   k  j   k
0  1  10  1  10
1  2  20  2  20

In [48]:
pd.concat([df1,df2], axis=1,keys=["python", "java"])

  python    java
       i  j    i   j
0      1  4    1  14
1      2  3    2  13
2      3  2    3  12
3      4  1    4  11